#+Title: Tangle Sources


* :shebang "#!emacs --script" :tangle ./orgmode-tangle/tangle/tangled.el  :mkdirp yes

#+begin_src emacs-lisp name: blkname  :var x=1  :session s1 :results replace  :exports both :shebang "#!emacs --script" :tangle ./orgmode-tangle/tangle/tangled.el  :mkdirp yes
(print "kookokokokoko")
(print x)
#+end_src

#+RESULTS:
: 1


* testando pra ver se funcionou

#+begin_src sh name: blkname :results output
cd ./orgmode-tangle/tangle/ && ls -l && cat tangled.el
#+end_src

#+RESULTS:
: total 4
: -rwxr-xr-x 1 administrador users 67 jan 20 17:45 tangled.el
: #!emacs --script
: (let ((x '1))
: (print "kookokokokoko")
: (print x)
: )

#+begin_example
[tangle] (administrador) √ $  ./tangled.el 

"kookokokokoko"

1

#+end_example
